In [6]:
import census_class
from pyvirtualdisplay import Display
display = Display(visible=0, size=(1920, 1080))  
display.start()

In [7]:
census_obj = census_class.scrape_us()
census_obj.get_us_data()

2021
2020
https://www.census.gov/programs-surveys/acs/news/data-releases.2020.html

In [8]:
clean_obj = census_class.clean_data()
clean_obj.clean_data()

In [9]:
display.stop()

In [43]:
import pymongo

uri = "mongodb://celebal:bZPUhXkQDcdWioAIiwECCdSEiZL3zmQ6bojzYjdiDxQlHhBgzKrJjiuYCWtEbSB4QcinajhByNwKbWlsRoBQ0A==@celebal.mongo.cosmos.azure.com:10255/?ssl=true&replicaSet=globaldb&retrywrites=false&maxIdleTimeMS=120000&appName=@celebal@"
client = pymongo.MongoClient(uri)
census_data = client.get_database(name="geography_sizing").get_collection(name='census_US')

In [44]:
cursor = census_data.find({})
d1 = '/home/celebal/Data/census_data/US/clean_data/median_age.csv'
d2 = '/home/celebal/Data/census_data/US/clean_data/median_income.csv'
d3 = '/home/celebal/Data/census_data/US/clean_data/population.csv'

In [45]:
import pandas as pd

df1 = pd.read_csv(d1)
df2 = pd.read_csv(d2)
df3 = pd.read_csv(d3)

In [46]:
df1.drop(columns = {'Unnamed: 0'}, inplace = True)
df2.drop(columns = {'Unnamed: 0'}, inplace = True)
df3.drop(columns = {'Unnamed: 0'}, inplace = True)

In [47]:
df1.head()

  state_code  median_age
0         AL        39.7
1         AK        35.5
2         AZ        38.6
3         AR        38.5
4         CA        37.3

In [48]:
df2.head()

  state_code  median_income
0         AL          53956
1         AK          80197
2         AZ          64777
3         AR          51183
4         CA          83056

In [49]:
df3.head()

  state_code  population
0         AL     4921532
1         AK      731158
2         AZ     7421401
3         AR     3030522
4         CA    39368078

In [50]:
df1.state_code.equals(df2.state_code)

True

In [51]:
df1.state_code.equals(df3.state_code)

True

In [52]:
state_codes = list(df1.state_code.values)
print(len(state_codes))

51

In [53]:
median_age = [int(i) for i in list(df1.median_age.values)]
median_income = [int(i) for i in list(df2.median_income.values)]
population = [int(i) for i in list(df3.population.values)]

In [54]:
type(int(median_income[0]))

int

In [55]:
print(len(median_age))
print(len(median_income))
print(len(population))

51
51
51

In [56]:
for i in range(len(state_codes)):
    dic ={'_id':state_codes[i], 'median_age':median_age[i],'median_income':median_income[i], 'population':population[i] }
    census_data.insert_one(dic)